In [1]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

import getpass
password = getpass.getpass()

········

In [2]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [3]:
def rentals_month(engine, month, year):
    # Retrieve rental data for a given month and year from the Sakila database
    query = f"SELECT customer_id, COUNT(rental_id) as rental_count FROM rental WHERE MONTH(rental_date) = {month} AND YEAR(rental_date) = {year} GROUP BY customer_id"
    df = pd.read_sql_query(query, engine)
    return df

In [4]:
def rental_count_month(df, month, year):
    # Calculate the number of rentals made by each customer_id during the selected month and year
    df.rename(columns={'rental_count': f'rentals_{month}_{year}'}, inplace=True)
    return df

In [5]:
def compare_rentals(df1, df2):
    # Combine two DataFrames and calculate the difference in rental counts
    combined_df = pd.merge(df1, df2, on='customer_id', how='outer')
    combined_df['difference'] = combined_df[df2.columns[1]] - combined_df[df1.columns[1]]
    return combined_df

In [6]:
df1 = rental_count_month(rentals_month(engine, 5, 2005), 5, 2005)
df2 = rental_count_month(rentals_month(engine, 6, 2005), 6, 2005)
compare_rentals(df1, df2)

     customer_id  rentals_5_2005  rentals_6_2005  difference
0              1             2.0             7.0         5.0
1              2             1.0             1.0         0.0
2              3             2.0             4.0         2.0
3              5             3.0             5.0         2.0
4              6             3.0             4.0         1.0
..           ...             ...             ...         ...
593          583             NaN             6.0         NaN
594          585             NaN             4.0         NaN
595          591             NaN             3.0         NaN
596          592             NaN             5.0         NaN
597          598             NaN             1.0         NaN

[598 rows x 4 columns]

In [7]:

df_may = rentals_month(engine, 5, 2023)
df_june = rentals_month(engine, 6, 2023)

df_may = rental_count_month(df_may, 5, 2023)
df_june = rental_count_month(df_june, 6, 2023)

comparison_df = compare_rentals(df_may, df_june)
print(comparison_df.head())

Empty DataFrame
Columns: [rentals_5_2023, customer_id, rentals_6_2023, difference]
Index: []